org/my-init.org
#+TITLE: Emacs Configuration
#+AUTHOR: Kevin Li
#+DATE: August 2015
#+DATE: August 23, 2015

* Prelude
This file is tangled and loaded via =init.el=, which
should just contain the following.
#+BEGIN_SRC emacs-lisp :tangle no
(require 'org)
(org-babel-load-file
 (expand-file-name
  "my-init.org"
  (concat user-emacs-directory "org"
   )))
#+END_SRC



* Package Setup
Most of the settings rely on installing packages. So the first
order of business is to initialize the package system.
#+BEGIN_SRC emacs-lisp
;; so we don't get bothered about coding system
(prefer-coding-system 'utf-8) 

(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives '("melpa" .
                                 "http://melpa.org/packages/"))
(package-initialize)
#+END_SRC
Next, we pull in the conveninence package =use-package=,
which is used to actually configure the packages
#+BEGIN_SRC emacs-lisp
;; Bootstrap `use-package'
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'use-package)
#+END_SRC



* General Settings
These following settings should always be on, and depends
only on an up-to-date Emacs installation. They try to
provide a comfortable experience for debugging init files
in the case that the rest of the things somehow break.
** The Custom File
Don't litter =init.el= with customizations with =Customize=.
Create an empty file for it, in case it is not present.
#+BEGIN_SRC emacs-lisp
(setq custom-file "~/.emacs.d/emacs-custom.el")
(if (not (file-exists-p custom-file))
    (write-region "" nil custom-file))

(load custom-file)
#+END_SRC

The =custom-file= is not kept under version control, so it is
convenient to put some personal settings in there that shouldn't be
seen on Github.  

The following function takes in a symbol and a
prompt; if the symbol isn't defined at this point (after the custom
file's loaded), then prompt the user for its value. Afterwards, put in the
custom file so it needn't be asked again.
#+BEGIN_SRC emacs-lisp :tangle yes
(defun ensure-in-custom (SYM PROMPT)
  (interactive)
  (if (not (boundp SYM))
      (let* ((entry (read-from-minibuffer PROMPT))
             (symbol (symbol-name SYM))
             (piece `(setq ,SYM ,entry)))
        (eval piece)
        (write-region (concat (prin1-to-string piece) "\n")
         nil custom-file 'append)
        )))
#+END_SRC
Now make sure that our full name and email address are always defined.
#+BEGIN_SRC emacs-lisp :tangle yes
(ensure-in-custom 'full-name "Enter your full name: ")
(ensure-in-custom 'email-address "Enter your email address: ")
#+END_SRC


** Home and Dropbox Folder setup
It is convenient to know where my "home" folder is (not the folder
that Emacs thinks is home), and also where the Dropbox folder
is. Later, we may define some shortcuts using these constants.
#+BEGIN_SRC emacs-lisp
  (setq user-home-folder
        (file-name-as-directory
         ;; Windows doesn't use the ~ convention
         (if (eq system-type 'windows-nt)
             (substitute-in-file-name "$HOMEDRIVE$HOMEPATH")
             "~")))

  (setq user-dropbox-folder
        (file-name-as-directory
         (concat user-home-folder "Dropbox")))
#+END_SRC


** General Settings
These settings should always be present.
*** Better Defaults
A no-frills package to set some sensible defaults.
#+BEGIN_SRC emacs-lisp
  (use-package better-defaults
      :ensure t)
#+END_SRC
*** Visuals
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
(setq inhibit-startup-message t)
#+END_SRC

*** Tab Settings
#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
(defvaralias 'c-basic-offset 'tab-width)
(defvaralias 'cperl-indent-level 'tab-width)
#+END_SRC

