org/my-init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Configuration</title>
<!-- 2015-08-20 Thu 11:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kevin Li" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Prelude</a></li>
<li><a href="#sec-2">2. Package Setup</a></li>
<li><a href="#sec-3">3. General Settings</a>
<ul>
<li><a href="#sec-3-1">3.1. The Custom File</a></li>
<li><a href="#sec-3-2">3.2. Home and Dropbox Folder setup</a></li>
<li><a href="#sec-3-3">3.3. General Settings</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Better Defaults</a></li>
<li><a href="#sec-3-3-2">3.3.2. Visuals</a></li>
<li><a href="#sec-3-3-3">3.3.3. Tab Settings</a></li>
<li><a href="#sec-3-3-4">3.3.4. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Ido, Recentf, and Smex</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. General settings</a></li>
<li><a href="#sec-3-4-2">3.4.2. Ido everywhere</a></li>
<li><a href="#sec-3-4-3">3.4.3. Recentf</a></li>
<li><a href="#sec-3-4-4">3.4.4. Smex</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Mac OS X specific settings</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Look and Feel</a>
<ul>
<li><a href="#sec-4-1">4.1. Themes</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Activate theme</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Fonts</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Activating a font</a></li>
<li><a href="#sec-4-2-2">4.2.2. <span class="todo TODO">TODO</span> cycle between fonts</a></li>
<li><a href="#sec-4-2-3">4.2.3. <span class="todo TODO">TODO</span> Check whether the font exists</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Smart Mode Line</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. <span class="todo TODO">TODO</span> Investigate this more and make it more functional</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. Line Numbers</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Evil Mode</a>
<ul>
<li><a href="#sec-5-1">5.1. <span class="todo TODO">TODO</span> Include evil mode stuff</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Yasnippet</a>
<ul>
<li><a href="#sec-6-1">6.1. <span class="todo TODO">TODO</span> Add different folders for different modes of snippet files</a></li>
<li><a href="#sec-6-2">6.2. <span class="todo TODO">TODO</span> Add a shortcut for visiting snippet</a></li>
<li><a href="#sec-6-3">6.3. <span class="todo TODO">TODO</span> Add a shortcut for creating a snippet.</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Smartparens</a></li>
<li><a href="#sec-8">8. Org Mode</a>
<ul>
<li><a href="#sec-8-1">8.1. Appearance</a></li>
<li><a href="#sec-8-2">8.2. Editing features</a></li>
<li><a href="#sec-8-3">8.3. Directory structure</a></li>
<li><a href="#sec-8-4">8.4. Custom key binds</a></li>
<li><a href="#sec-8-5">8.5. Support for LaTeX in Org</a>
<ul>
<li><a href="#sec-8-5-1">8.5.1. Inside Org Mode</a></li>
<li><a href="#sec-8-5-2">8.5.2. Exporting to LaTeX</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-9">9. Emacs-Lisp</a></li>
<li><a href="#sec-10">10. LaTeX</a></li>
<li><a href="#sec-11">11. Clojure</a></li>
<li><a href="#sec-12">12. Epilog</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prelude</h2>
<div class="outline-text-2" id="text-1">
<p>
This file is tangled and loaded via <code>init.el</code>, which
should just contain the following.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">require</span> '<span style="color: #F77669;">org</span>)
(org-babel-load-file
 (expand-file-name
  <span style="color: #74CBC4;">"my-init.org"</span>
  (concat user-emacs-directory <span style="color: #74CBC4;">"org"</span>
   )))
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Package Setup</h2>
<div class="outline-text-2" id="text-2">
<p>
Most of the settings rely on installing packages. So the first
order of business is to initialize the package system.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #546D7A;">;; </span><span style="color: #546D7A;">so we don't get bothered about coding system</span>
(prefer-coding-system 'utf-8) 

(<span style="color: #F9D339; font-weight: bold;">require</span> '<span style="color: #F77669;">package</span>)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives '(<span style="color: #74CBC4;">"melpa"</span> .
                                 <span style="color: #74CBC4;">"http://melpa.org/packages/"</span>))
(package-initialize)
</pre>
</div>
<p>
Next, we pull in the conveninence package <code>use-package</code>,
which is used to actually configure the packages
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #546D7A;">;; </span><span style="color: #546D7A;">Bootstrap `</span><span style="color: #F77669;">use-package</span><span style="color: #546D7A;">'</span>
(<span style="color: #F9D339; font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(<span style="color: #F9D339; font-weight: bold;">require</span> '<span style="color: #F77669;">use-package</span>)
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> General Settings</h2>
<div class="outline-text-2" id="text-3">
<p>
These following settings should always be on, and depends
only on an up-to-date Emacs installation. They try to
provide a comfortable experience for debugging init files
in the case that the rest of the things somehow break.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The Custom File</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Don't litter <code>init.el</code> with customizations with <code>Customize</code>.
Create an empty file for it, in case it is not present.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq custom-file <span style="color: #74CBC4;">"~/.emacs.d/emacs-custom.el"</span>)
(<span style="color: #F9D339; font-weight: bold;">if</span> (not (file-exists-p custom-file))
    (write-region <span style="color: #74CBC4;">""</span> nil custom-file))

(load custom-file)
</pre>
</div>

<p>
The <code>custom-file</code> is not kept under version control, so it is
convenient to put some personal settings in there that shouldn't be
seen on Github.  
</p>

<p>
The following function takes in a symbol and a
prompt; if the symbol isn't defined at this point (after the custom
file's loaded), then prompt the user for its value. Afterwards, put in the
custom file so it needn't be asked again.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">defun</span> <span style="color: #FF516D;">ensure-in-custom</span> (SYM PROMPT)
  (interactive)
  (<span style="color: #F9D339; font-weight: bold;">if</span> (not (boundp SYM))
      (<span style="color: #F9D339; font-weight: bold;">let*</span> ((entry (read-from-minibuffer PROMPT))
             (symbol (symbol-name SYM))
             (piece `(setq ,SYM ,entry)))
        (eval piece)
        (write-region (concat (prin1-to-string piece) <span style="color: #74CBC4;">"\n"</span>)
         nil custom-file 'append)
        )))
</pre>
</div>
<p>
Now make sure that our full name and email address are always defined.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(ensure-in-custom 'user-full-name <span style="color: #74CBC4;">"Enter your full name: "</span>)
(ensure-in-custom 'email-address <span style="color: #74CBC4;">"Enter your email address: "</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Home and Dropbox Folder setup</h3>
<div class="outline-text-3" id="text-3-2">
<p>
It is convenient to know where my "home" folder is (not the folder
that Emacs thinks is home), and also where the Dropbox folder
is. Later, we may define some shortcuts using these constants.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-home-folder
      (file-name-as-directory
       <span style="color: #546D7A;">;; </span><span style="color: #546D7A;">Windows doesn't use the ~ convention</span>
       (<span style="color: #F9D339; font-weight: bold;">if</span> (eq system-type 'windows-nt)
           (substitute-in-file-name <span style="color: #74CBC4;">"$HOMEDRIVE$HOMEPATH"</span>)
           <span style="color: #74CBC4;">"~"</span>)))

(setq user-dropbox-folder
      (file-name-as-directory
       (concat user-home-folder <span style="color: #74CBC4;">"Dropbox"</span>)))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> General Settings</h3>
<div class="outline-text-3" id="text-3-3">
<p>
These settings should always be present.
</p>
</div>
<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Better Defaults</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
A no-frills package to set some sensible defaults.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">better-defaults</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Visuals</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ring-bell-function 'ignore)
(setq inhibit-startup-message t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Tab Settings</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default tab-width 4)
(<span style="color: #F9D339; font-weight: bold;">defvaralias</span> '<span style="color: #C2E982;">c-basic-offset</span> 'tab-width)
(<span style="color: #F9D339; font-weight: bold;">defvaralias</span> '<span style="color: #C2E982;">cperl-indent-level</span> 'tab-width)
</pre>
</div>
</div>
</div>
