org/my-init.org
*** Miscellaneous
Always show column numbers
#+BEGIN_SRC emacs-lisp
(column-number-mode t)
#+END_SRC

Never make me type =yes= or =no=.
#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Easier navigation with mark ring.
#+BEGIN_SRC emacs-lisp
(setq set-mark-command-repeat-pop t)
#+END_SRC

Don't garbage collect so much.
#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold (* 1024 1024 50))
#+END_SRC


** Ido, Recentf, and Smex
*** General settings
Ido is one of the reasons why Emacs is great! It takes a little bit of
setting up to make it more comfortable to use.

Enable virtual buffers: even if a buffer is closed, we still have
access to it.
#+BEGIN_SRC emacs-lisp
(setq ido-use-virtual-buffers t)
#+END_SRC

When a filename doesn't complete, ido will search recently used
names. This is annoying, so disable it.
#+BEGIN_SRC emacs-lisp
(setq ido-auto-merge-work-directories-length -1)
#+END_SRC

=Flx Ido= uses another algorithm to calculate matches which seems to
work better than the default.
#+BEGIN_SRC emacs-lisp
(use-package flx-ido
    :ensure t
    :config (flx-ido-mode 1))
#+END_SRC

Make the completion interface vertical; it is more legible this way.
In addition, define up and down keys, because =<left>= and =<right>=
arrows are too inconvenient.
#+BEGIN_SRC emacs-lisp
(use-package ido-vertical-mode
    :ensure t
    :config
    (progn
      (ido-vertical-mode 1)
      (defun ido-define-keys () ;; C-n/p is more intuitive in vertical layout
        (define-key ido-completion-map (kbd "C-n") 'ido-next-match)
        (define-key ido-completion-map (kbd "C-j") 'ido-next-match)
        (define-key ido-completion-map (kbd "C-k") 'ido-prev-match)
        (define-key ido-completion-map (kbd "C-p") 'ido-prev-match))
      (add-hook 'ido-setup-hook 'ido-define-keys)))
#+END_SRC

*** Ido everywhere
Use Ido for most completions; sadly this doesn't quite cover 100% of
the cases yet, but it's close.
#+BEGIN_SRC emacs-lisp
(ido-everywhere)
(use-package ido-ubiquitous
    :ensure t
    :init
    (progn
      (ido-ubiquitous-mode 1)
      (defmacro ido-ubiquitous-use-new-completing-read (cmd package)
        `(eval-after-load ,package
           '(defadvice ,cmd (around ido-ubiquitous-new activate)
             (let ((ido-ubiquitous-enable-compatibility nil))
               ad-do-it)))))
    :config
    (progn
      (ido-ubiquitous-use-new-completing-read yas/expand 'yasnippet)
      (ido-ubiquitous-use-new-completing-read yas/visit-snippet-file 'yasnippet)))
#+END_SRC
The last two lines are used to make make completing with =yasnippet=
work well.

**** TODO Investigate Helm?

*** Recentf
Recentf supports Ido mode by keeping track of recently organized files.
#+BEGIN_SRC emacs-lisp
(use-package recentf
    :config
  (progn
    (recentf-mode 1)
    (setq recentf-max-menu-items 500)))
#+END_SRC

*** Smex
=M-x= support but for ido.
#+BEGIN_SRC emacs-lisp
(use-package smex
    :ensure t
    :bind
    (("M-x" . smex)
     ("C-x C-m" . smex)
     ("C-c C-m" . smex)
     ("C-c m" . smex)
     ("C-x m" . smex)))
#+END_SRC



** Mac OS X specific settings
We need let Emacs know about the the =LaTeX= path
for =LaTeX= to work.
#+BEGIN_SRC emacs-lisp
  (if (eq system-type 'darwin)
      (progn
        (defun set-exec-path-from-shell-PATH ()
          (let ((path-from-shell
                 (shell-command-to-string
                  "TERM=vt100 $SHELL -i -c 'echo $PATH'")))

            (setenv "PATH" path-from-shell)
            (setq exec-path (split-string path-from-shell path-separator))))

        (when window-system (set-exec-path-from-shell-PATH))

        (getenv "PATH")
        (setenv "PATH" (concat "/usr/texbin" ":" (getenv "PATH")))

        (setenv "PATH" (concat (getenv "PATH") ":/usr/local/bin"))
        (setq exec-path (append exec-path '("/usr/local/bin")))

        (setenv "PATH" (concat (getenv "PATH") ":/usr/bin"))
        (setq exec-path (append exec-path '("/usr/bin")))))
#+END_SRC


* Look and Feel
Here, we install various themes.  Install =emacs24= themes and set up
a font. I'm not sure at this point whether to simply /install/ the
themes or actually activate them.
** Themes
Install but defer.
#+BEGIN_SRC emacs-lisp
(use-package color-theme-sanityinc-tomorrow
    :defer t
    :ensure t)
(use-package ample-theme
    :defer t
    :ensure t)
(use-package smyx-theme
    :defer t
    :ensure t)
(use-package aurora-theme
    :defer t
    :ensure t)
#+END_SRC
*** Activate theme
The =aurora-theme= is the current favorite.
The extra =t= flag is so we don't get asked about treating themes
as safe.
#+BEGIN_SRC emacs-lisp
(load-theme 'aurora t)
#+END_SRC


** Fonts
