org/my-init.html

<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> Miscellaneous</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Always show column numbers
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(column-number-mode t)
</pre>
</div>

<p>
Never make me type <code>yes</code> or <code>no</code>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">defalias</span> '<span style="color: #FF516D;">yes-or-no-p</span> 'y-or-n-p)
</pre>
</div>

<p>
Easier navigation with mark ring.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq set-mark-command-repeat-pop t)
</pre>
</div>

<p>
Don't garbage collect so much.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq gc-cons-threshold (* 1024 1024 50))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Ido, Recentf, and Smex</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> General settings</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Ido is one of the reasons why Emacs is great! It takes a little bit of
setting up to make it more comfortable to use.
</p>

<p>
Enable virtual buffers: even if a buffer is closed, we still have
access to it.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ido-use-virtual-buffers t)
</pre>
</div>

<p>
When a filename doesn't complete, ido will search recently used
names. This is annoying, so disable it.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq ido-auto-merge-work-directories-length -1)
</pre>
</div>

<p>
<code>Flx Ido</code> uses another algorithm to calculate matches which seems to
work better than the default.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">flx-ido</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:config</span> (flx-ido-mode 1))
</pre>
</div>

<p>
Make the completion interface vertical; it is more legible this way.
In addition, define up and down keys, because <code>&lt;left&gt;</code> and <code>&lt;right&gt;</code>
arrows are too inconvenient.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">ido-vertical-mode</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:config</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (ido-vertical-mode 1)
      (<span style="color: #F9D339; font-weight: bold;">defun</span> <span style="color: #FF516D;">ido-define-keys</span> () <span style="color: #546D7A;">;; </span><span style="color: #546D7A;">C-n/p is more intuitive in vertical layout</span>
        (define-key ido-completion-map (kbd <span style="color: #74CBC4;">"C-n"</span>) 'ido-next-match)
        (define-key ido-completion-map (kbd <span style="color: #74CBC4;">"C-j"</span>) 'ido-next-match)
        (define-key ido-completion-map (kbd <span style="color: #74CBC4;">"C-k"</span>) 'ido-prev-match)
        (define-key ido-completion-map (kbd <span style="color: #74CBC4;">"C-p"</span>) 'ido-prev-match))
      (add-hook 'ido-setup-hook 'ido-define-keys)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Ido everywhere</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
Use Ido for most completions; sadly this doesn't quite cover 100% of
the cases yet, but it's close.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(ido-everywhere)
(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">ido-ubiquitous</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:init</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (ido-ubiquitous-mode 1)
      (<span style="color: #F9D339; font-weight: bold;">defmacro</span> <span style="color: #FF516D;">ido-ubiquitous-use-new-completing-read</span> (cmd package)
        `(eval-after-load ,package
           '(<span style="color: #F9D339; font-weight: bold;">defadvice</span> ,cmd (around ido-ubiquitous-new activate)
             (<span style="color: #F9D339; font-weight: bold;">let</span> ((ido-ubiquitous-enable-compatibility nil))
               ad-do-it)))))
    <span style="color: #CDD3D3; font-weight: bold;">:config</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (ido-ubiquitous-use-new-completing-read yas/expand 'yasnippet)
      (ido-ubiquitous-use-new-completing-read yas/visit-snippet-file 'yasnippet)))
</pre>
</div>
<p>
The last two lines are used to make make completing with <code>yasnippet</code>
work well.
</p>
</div>

<ol class="org-ol"><li><a id="sec-3-4-2-1" name="sec-3-4-2-1"></a><span class="todo TODO">TODO</span> Investigate Helm?<br  /></li></ol>
</div>

<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> Recentf</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
Recentf supports Ido mode by keeping track of recently organized files.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">recentf</span>
    <span style="color: #CDD3D3; font-weight: bold;">:config</span>
  (<span style="color: #F9D339; font-weight: bold;">progn</span>
    (recentf-mode 1)
    (setq recentf-max-menu-items 500)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> Smex</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
<code>M-x</code> support but for ido.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">smex</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:bind</span>
    ((<span style="color: #74CBC4;">"M-x"</span> . smex)
     (<span style="color: #74CBC4;">"C-x C-m"</span> . smex)
     (<span style="color: #74CBC4;">"C-c C-m"</span> . smex)
     (<span style="color: #74CBC4;">"C-c m"</span> . smex)
     (<span style="color: #74CBC4;">"C-x m"</span> . smex)))
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Mac OS X specific settings</h3>
<div class="outline-text-3" id="text-3-5">
<p>
We need let Emacs know about the the <code>LaTeX</code> path
for <code>LaTeX</code> to work.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">if</span> (eq system-type 'darwin)
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (<span style="color: #F9D339; font-weight: bold;">defun</span> <span style="color: #FF516D;">set-exec-path-from-shell-PATH</span> ()
        (<span style="color: #F9D339; font-weight: bold;">let</span> ((path-from-shell
               (shell-command-to-string
                <span style="color: #74CBC4;">"TERM=vt100 $SHELL -i -c 'echo $PATH'"</span>)))

          (setenv <span style="color: #74CBC4;">"PATH"</span> path-from-shell)
          (setq exec-path (split-string path-from-shell path-separator))))

      (<span style="color: #F9D339; font-weight: bold;">when</span> window-system (set-exec-path-from-shell-PATH))

      (getenv <span style="color: #74CBC4;">"PATH"</span>)
      (setenv <span style="color: #74CBC4;">"PATH"</span> (concat <span style="color: #74CBC4;">"/usr/texbin"</span> <span style="color: #74CBC4;">":"</span> (getenv <span style="color: #74CBC4;">"PATH"</span>)))

      (setenv <span style="color: #74CBC4;">"PATH"</span> (concat (getenv <span style="color: #74CBC4;">"PATH"</span>) <span style="color: #74CBC4;">":/usr/local/bin"</span>))
      (setq exec-path (append exec-path '(<span style="color: #74CBC4;">"/usr/local/bin"</span>)))

      (setenv <span style="color: #74CBC4;">"PATH"</span> (concat (getenv <span style="color: #74CBC4;">"PATH"</span>) <span style="color: #74CBC4;">":/usr/bin"</span>))
      (setq exec-path (append exec-path '(<span style="color: #74CBC4;">"/usr/bin"</span>)))))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Look and Feel</h2>
<div class="outline-text-2" id="text-4">
<p>
Here, we install various themes.  Install <code>emacs24</code> themes and set up
a font. I'm not sure at this point whether to simply <i>install</i> the
themes or actually activate them.
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Themes</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Install but defer.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">color-theme-sanityinc-tomorrow</span>
    <span style="color: #CDD3D3; font-weight: bold;">:defer</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t)
(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">ample-theme</span>
    <span style="color: #CDD3D3; font-weight: bold;">:defer</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t)
(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">smyx-theme</span>
    <span style="color: #CDD3D3; font-weight: bold;">:defer</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t)
(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">aurora-theme</span>
    <span style="color: #CDD3D3; font-weight: bold;">:defer</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Activate theme</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
The <code>aurora-theme</code> is the current favorite.
The extra <code>t</code> flag is so we don't get asked about treating themes
as safe.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-theme 'aurora t)
</pre>
</div>
</div>
</div>
</div>
