org/my-init.org
*** Activating a font
#+BEGIN_SRC emacs-lisp
  (defun my-set-face (font)
    (set-face-attribute 'default nil
                        :family font
                        :height 140
                        :weight 'normal
                        :width 'normal))

  (if (eq system-type 'darwin)
      (my-set-face "Menlo"))

  (if (eq system-type 'windows-nt)
      (my-set-face "Consolas"))
#+END_SRC

*** TODO cycle between fonts
Write a function (a la Spacemacs) that allows me to switch between fonts.
**** With ido support?

*** TODO Check whether the font exists

** Smart Mode Line
I'm actually not convined of the utility of this just yet,
but let's throw it in because it does look somewhat nicer than the
default mode line.
#+BEGIN_SRC emacs-lisp
(use-package smart-mode-line
    :ensure smart-mode-line
    :init
    (progn
      (setq sml/theme 'light)
      (setq sml/name-width 40)
      (setq sml/mode-width 'full))
    :config
    (progn
      (sml/setup)))
#+END_SRC

*** TODO Investigate this more and make it more functional


** Line Numbers
Line numbers are surprisingly clunky in Emacs, which above all
is a text editor. The =nlinum= package seems to be the best, and I
find it useful enough to enable it everywhere.
#+BEGIN_SRC emacs-lisp
(use-package nlinum
    :ensure t
    :init
    (global-nlinum-mode t))
#+END_SRC



* Evil Mode
After several iterations of
switching back and forth from Emacs and Vim, I gave Evil a go.
It worked great for a while, but in the end it was just more hassle
than it's worth, the reason being that key-binds in Emacs
and its many modes are not designed with modal input in mind.

Thus, it became a hassle to define new keys,
especially when I wanted to enable keys only for
insert mode only for certain key-maps. I can't find a good solution
for this, so I turned off =evil-mode= for the time being.

But my old =evil-mode= customizations are still useful
if I ever wanted to come back to it, so I include them here.
** TODO Include evil mode stuff
I need to figure out a way to reference (and attach?) files
to an org document.



* Yasnippet
Yasnippet is generally useful, except that it takes over
the =TAB= key, which performs crucial functions in Org mode and
CDLaTeX.

It seems that =C-;= is unused in both modes, so we will just map the
key to that.
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
      :ensure t
      :config
      (progn
        (yas-global-mode)
        (define-key yas-minor-mode-map (kbd "<tab>") nil)
        (define-key yas-minor-mode-map (kbd "TAB") nil)
        (define-key yas-minor-mode-map (kbd "C-;") 'yas-expand)))
#+END_SRC

** TODO Add different folders for different modes of snippet files

** TODO Add a shortcut for visiting snippet

** TODO Add a shortcut for creating a snippet.
   

* Smartparens
=Smartparens= is almost a necessity in C-like languages; it is less
essentially useless in Lisps because we will be using =paredit=. Also,
smartparens is kind of useful in (La)TeX mode, so we should turn it on
there in addition to Org mode.

#+BEGIN_SRC emacs-lisp
  (use-package smartparens-config
      :ensure smartparens
      :init
      :config
      (progn
        (smartparens-global-mode)
        (add-hook 'emacs-lisp-mode-hook 'turn-off-smartparens-mode)
        ;; Some LaTeX specific smartparens
        ))
#+END_SRC


* Paredit
Enable =paredit=; I still prefer it over =smartparens= because it
actually comes with a good set of keybindings, and old habits die
hard.
#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook       'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook 'enable-paredit-mode)
  (add-hook 'scheme-mode-hook           'enable-paredit-mode)
#+END_SRC



* Org Mode
** Appearance
Since we use Org Babel so often, it is important to highlight
code in source blocks.
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC

Fontify the whole heading to make it look nice.
#+BEGIN_SRC emacs-lisp
  (setq org-fontify-whole-heading-line t)
#+END_SRC


** Editing features
We can also allow plain lists starting with alphabet instead
of just numbers.
#+BEGIN_SRC emacs-lisp
  (setq org-list-allow-alphabetical t)
#+END_SRC

Let's be smart about invisible edits.
#+BEGIN_SRC emacs-lisp
  (setq org-catch-invisible-edits 'smart)
#+END_SRC


** Directory structure
Set the *default directory* for Org-mode.
#+BEGIN_SRC emacs-lisp
  (let ((org-folder
         (file-name-as-directory (concat user-dropbox-folder "ORG"))))
    (setq org-directory org-folder))
#+END_SRC


** Custom key binds
Set the global hotkeys which are commended in the manual.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)
  (global-set-key (kbd "C-c b") 'org-iswitchb)
#+END_SRC
  
We need an easier key on LaTeX. In future Org versions, use
=org-toggle-latex-fragment=.
#+BEGIN_SRC emacs-lisp
  (org-defkey org-mode-map (kbd "C-.") 'org-preview-latex-fragment)
#+END_SRC


