org/my-init.html


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Fonts</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Activating a font</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-attribute 'default nil
                    <span style="color: #CDD3D3; font-weight: bold;">:family</span> <span style="color: #74CBC4;">"Menlo"</span>
                    <span style="color: #CDD3D3; font-weight: bold;">:height</span> 140
                    <span style="color: #CDD3D3; font-weight: bold;">:weight</span> 'normal
                    <span style="color: #CDD3D3; font-weight: bold;">:width</span> 'normal)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> <span class="todo TODO">TODO</span> cycle between fonts</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Write a function (a la Spacemacs) that allows me to switch between fonts.
</p>
</div>
<ol class="org-ol"><li><a id="sec-4-2-2-1" name="sec-4-2-2-1"></a>With ido support?<br  /></li></ol>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> <span class="todo TODO">TODO</span> Check whether the font exists</h4>
</div>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Smart Mode Line</h3>
<div class="outline-text-3" id="text-4-3">
<p>
I'm actually not convined of the utility of this just yet,
but let's throw it in because it does look somewhat nicer than the
default mode line.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">smart-mode-line</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> smart-mode-line
    <span style="color: #CDD3D3; font-weight: bold;">:init</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (setq sml/theme 'light)
      (setq sml/name-width 40)
      (setq sml/mode-width 'full))
    <span style="color: #CDD3D3; font-weight: bold;">:config</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (sml/setup)))
</pre>
</div>
</div>

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> <span class="todo TODO">TODO</span> Investigate this more and make it more functional</h4>
</div>
</div>


<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Line Numbers</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Line numbers are surprisingly clunky in Emacs, which above all
is a text editor. The <code>nlinum</code> package seems to be the best, and I
find it useful enough to enable it everywhere.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">nlinum</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:init</span>
    (global-nlinum-mode t))
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Evil Mode</h2>
<div class="outline-text-2" id="text-5">
<p>
After several iterations of
switching back and forth from Emacs and Vim, I gave Evil a go.
It worked great for a while, but in the end it was just more hassle
than it's worth, the reason being that key-binds in Emacs
and its many modes are not designed with modal input in mind.
</p>

<p>
Thus, it became a hassle to define new keys,
especially when I wanted to enable keys only for
insert mode only for certain key-maps. I can't find a good solution
for this, so I turned off <code>evil-mode</code> for the time being.
</p>

<p>
But my old <code>evil-mode</code> customizations are still useful
if I ever wanted to come back to it, so I include them here.
</p>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Include evil mode stuff</h3>
<div class="outline-text-3" id="text-5-1">
<p>
I need to figure out a way to reference (and attach?) files
to an org document.
</p>
</div>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Yasnippet</h2>
<div class="outline-text-2" id="text-6">
<p>
Yasnippet is generally useful, except that it takes over
the <code>TAB</code> key, which performs crucial functions in Org mode and
CDLaTeX.
</p>

<p>
It seems that <code>C-;</code> is unused in both modes, so we will just map the
key to that. There is no reason to load <code>yasnippet</code> until we expand
or a create a snippet, defer loading using <code>:commands</code>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">yasnippet</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> t
    <span style="color: #CDD3D3; font-weight: bold;">:commands</span> (yas-expand yas-new-snippet yas-visit-snippet-file)
    <span style="color: #CDD3D3; font-weight: bold;">:config</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (yas-global-mode)
      (define-key yas-minor-mode-map (kbd <span style="color: #74CBC4;">"&lt;tab&gt;"</span>) nil)
      (define-key yas-minor-mode-map (kbd <span style="color: #74CBC4;">"TAB"</span>) nil)
      (define-key yas-minor-mode-map (kbd <span style="color: #74CBC4;">"C-;"</span>) 'yas-expand)))
</pre>
</div>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <span class="todo TODO">TODO</span> Add different folders for different modes of snippet files</h3>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> <span class="todo TODO">TODO</span> Add a shortcut for visiting snippet</h3>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> <span class="todo TODO">TODO</span> Add a shortcut for creating a snippet.</h3>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Smartparens</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>Smartparens</code> is almost a necessity in C-like languages; it is less
essentially useless in Lisps because we will be using <code>paredit</code>. Also,
smartparens is kind of useful in (La)TeX mode, so we should turn it on
there in addition to Org mode.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">use-package</span> <span style="color: #F77669;">smartparens-config</span>
    <span style="color: #CDD3D3; font-weight: bold;">:ensure</span> smartparens
    <span style="color: #CDD3D3; font-weight: bold;">:init</span>
    <span style="color: #CDD3D3; font-weight: bold;">:config</span>
    (<span style="color: #F9D339; font-weight: bold;">progn</span>
      (smartparens-global-mode)
      (add-hook 'emacs-lisp-mode-hook 'turn-off-smartparens-mode)
      <span style="color: #546D7A;">;; </span><span style="color: #546D7A;">Some LaTeX specific smartparens</span>
      ))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Org Mode</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Appearance</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Since we use Org Babel so often, it is important to highlight
code in source blocks.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-src-fontify-natively t)
</pre>
</div>

<p>
Fontify the whole heading to make it look nice.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-fontify-whole-heading-line t)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Editing features</h3>
<div class="outline-text-3" id="text-8-2">
<p>
We can also allow plain lists starting with alphabet instead
of just numbers.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-list-allow-alphabetical t)
</pre>
</div>

<p>
Let's be smart about invisible edits.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-catch-invisible-edits 'smart)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Directory structure</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Set the <b>default directory</b> for Org-mode.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F9D339; font-weight: bold;">let</span> ((org-folder
       (file-name-as-directory (concat user-dropbox-folder <span style="color: #74CBC4;">"ORG"</span>))))
  (setq org-directory org-folder))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Custom key binds</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Set the global hotkeys which are commended in the manual.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #74CBC4;">"C-c l"</span>) 'org-store-link)
(global-set-key (kbd <span style="color: #74CBC4;">"C-c a"</span>) 'org-agenda)
(global-set-key (kbd <span style="color: #74CBC4;">"C-c c"</span>) 'org-capture)
(global-set-key (kbd <span style="color: #74CBC4;">"C-c b"</span>) 'org-iswitchb)
</pre>
</div>

<p>
We need an easier key on LaTeX. In future Org versions, use
<code>org-toggle-latex-fragment</code>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-defkey org-mode-map (kbd <span style="color: #74CBC4;">"C-."</span>) 'org-preview-latex-fragment)
</pre>
</div>
</div>
</div>
